#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-1s1RCbrziMfbya6T

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=4069866d1b3d192f4cb0215ed1614137b5e14e23]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210824010311758600000002]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210824010311722500000001]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://A000627F84EED29E16FC1203768E6D36.sk1.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF3TlRrMU5Gb1hEVE14TURneU1qQXdOVGsxTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTndpCjJITGp0UnhNQkw0S0ltOVNzbVFoZlZHQTFpQjFLcHNnZkdmTUhVanVxWkpvWTdZUVNWaEJZRzBXK2ZvYjVOS2MKMFpzSlNyanBweDhCM0YxYTdlaDZZYnp5VSs5d0pTMXRpb1JRV0J4NGVFTndiTEFYdTh5SGtlTzVlL3BXUTRWYQpNRHg1Rlc5cmlGRENacEViZmNuVGVuZXJEeHMxaVJKSThUNVFwSDlMbEJROHBKbVFJend4SUtrQWRVeFdXREJaCm9VK0FNemU4bWtielRyRmVFOFJKZkMrVGVuMFV2R09WV013aDJOOE0yY0hrU29WSnFDMiszZm11Zi8vSGpwVDEKUkM4cGlXRjZuL1lsYmRWWlBvM241aTROWW1YbEJhaTAzdlVFTk9DTHdsMEZxRTF3Z2JMSlY1SFJqdTZlUXgxMwo3TFdSUXBSekdjTFgrbkwxTWVFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZPOHR4UHBmR3pnU1JuY1JHK2huOFhkcU1QbEZNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFES0FJdlczT3BMT004VEs2a21YK1orbGNXcjN5UEpIQVU4YWY0bTdiQnZOZHI5VGlwYgpHQ3NrRitsdndLVE9xOEIwYzZnL0xBcUZZVC9wTldZcXI5MFIzLzNVd3ZKd0FzVm9RZlNiaTlrZFBWY0toSWVCCmJ6M1AydU9NZHhCT3JLV2NZTS9VV0hhNXNwMnVRay9vZ0FpMnk3N045czkyNU1JbXRjdEo2c3VZS2R0VWNYV0oKNCsyOE80RkxSS20xb09lYzIzajdLakJYam9zZURFditQYUNMQVRJRGMwSm9KWEZMUW5FTUplMDZmQzRQc3lTKwowS1FzRGVWRTFtMEVhV3V4TlE1aFpxS2ZhZnBwMjJNQWxrdmZqaVBkbWpYTWZkK096ZHFHSEJEbDdkbjViMlo3CnJpTVVPZkVrdDY5WnVFZi9CTm0wK3VJSDJSMkZWemtSemFMNgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks-PvJaEFg9
            
            contexts:
            - context:
                cluster: eks_mlops-eks-PvJaEFg9
                user: eks_mlops-eks-PvJaEFg9
              name: eks_mlops-eks-PvJaEFg9
            
            current-context: eks_mlops-eks-PvJaEFg9
            
            users:
            - name: eks_mlops-eks-PvJaEFg9
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks-PvJaEFg9"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_mlops-eks-PvJaEFg9" -> null
      - id                   = "4069866d1b3d192f4cb0215ed1614137b5e14e23" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF3TlRrMU5Gb1hEVE14TURneU1qQXdOVGsxTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTndpCjJITGp0UnhNQkw0S0ltOVNzbVFoZlZHQTFpQjFLcHNnZkdmTUhVanVxWkpvWTdZUVNWaEJZRzBXK2ZvYjVOS2MKMFpzSlNyanBweDhCM0YxYTdlaDZZYnp5VSs5d0pTMXRpb1JRV0J4NGVFTndiTEFYdTh5SGtlTzVlL3BXUTRWYQpNRHg1Rlc5cmlGRENacEViZmNuVGVuZXJEeHMxaVJKSThUNVFwSDlMbEJROHBKbVFJend4SUtrQWRVeFdXREJaCm9VK0FNemU4bWtielRyRmVFOFJKZkMrVGVuMFV2R09WV013aDJOOE0yY0hrU29WSnFDMiszZm11Zi8vSGpwVDEKUkM4cGlXRjZuL1lsYmRWWlBvM241aTROWW1YbEJhaTAzdlVFTk9DTHdsMEZxRTF3Z2JMSlY1SFJqdTZlUXgxMwo3TFdSUXBSekdjTFgrbkwxTWVFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZPOHR4UHBmR3pnU1JuY1JHK2huOFhkcU1QbEZNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFES0FJdlczT3BMT004VEs2a21YK1orbGNXcjN5UEpIQVU4YWY0bTdiQnZOZHI5VGlwYgpHQ3NrRitsdndLVE9xOEIwYzZnL0xBcUZZVC9wTldZcXI5MFIzLzNVd3ZKd0FzVm9RZlNiaTlrZFBWY0toSWVCCmJ6M1AydU9NZHhCT3JLV2NZTS9VV0hhNXNwMnVRay9vZ0FpMnk3N045czkyNU1JbXRjdEo2c3VZS2R0VWNYV0oKNCsyOE80RkxSS20xb09lYzIzajdLakJYam9zZURFditQYUNMQVRJRGMwSm9KWEZMUW5FTUplMDZmQzRQc3lTKwowS1FzRGVWRTFtMEVhV3V4TlE1aFpxS2ZhZnBwMjJNQWxrdmZqaVBkbWpYTWZkK096ZHFHSEJEbDdkbjViMlo3CnJpTVVPZkVrdDY5WnVFZi9CTm0wK3VJSDJSMkZWemtSemFMNgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 00:54:20.847 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://A000627F84EED29E16FC1203768E6D36.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/A000627F84EED29E16FC1203768E6D36"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "test"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-04d843860f8e02280"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - subnet_ids                = [
                  - "subnet-00dd6ad17f28e0110",
                  - "subnet-073345847327cab44",
                  - "subnet-0aff3cd4393d112eb",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210824010311758600000002" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ vpc_zone_identifier       = [
          - "subnet-00dd6ad17f28e0110",
          + "subnet-02b7b75b8875b6f02",
          + "subnet-06dff361d9daa34ea",
          - "subnet-073345847327cab44",
          + "subnet-0a134ea213c4bf0e2",
          - "subnet-0aff3cd4393d112eb",
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210824010311722500000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ vpc_zone_identifier       = [
          - "subnet-00dd6ad17f28e0110",
          + "subnet-02b7b75b8875b6f02",
          + "subnet-06dff361d9daa34ea",
          - "subnet-073345847327cab44",
          + "subnet-0a134ea213c4bf0e2",
          - "subnet-0aff3cd4393d112eb",
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF3TlRrMU5Gb1hEVE14TURneU1qQXdOVGsxTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTndpCjJITGp0UnhNQkw0S0ltOVNzbVFoZlZHQTFpQjFLcHNnZkdmTUhVanVxWkpvWTdZUVNWaEJZRzBXK2ZvYjVOS2MKMFpzSlNyanBweDhCM0YxYTdlaDZZYnp5VSs5d0pTMXRpb1JRV0J4NGVFTndiTEFYdTh5SGtlTzVlL3BXUTRWYQpNRHg1Rlc5cmlGRENacEViZmNuVGVuZXJEeHMxaVJKSThUNVFwSDlMbEJROHBKbVFJend4SUtrQWRVeFdXREJaCm9VK0FNemU4bWtielRyRmVFOFJKZkMrVGVuMFV2R09WV013aDJOOE0yY0hrU29WSnFDMiszZm11Zi8vSGpwVDEKUkM4cGlXRjZuL1lsYmRWWlBvM241aTROWW1YbEJhaTAzdlVFTk9DTHdsMEZxRTF3Z2JMSlY1SFJqdTZlUXgxMwo3TFdSUXBSekdjTFgrbkwxTWVFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZPOHR4UHBmR3pnU1JuY1JHK2huOFhkcU1QbEZNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFES0FJdlczT3BMT004VEs2a21YK1orbGNXcjN5UEpIQVU4YWY0bTdiQnZOZHI5VGlwYgpHQ3NrRitsdndLVE9xOEIwYzZnL0xBcUZZVC9wTldZcXI5MFIzLzNVd3ZKd0FzVm9RZlNiaTlrZFBWY0toSWVCCmJ6M1AydU9NZHhCT3JLV2NZTS9VV0hhNXNwMnVRay9vZ0FpMnk3N045czkyNU1JbXRjdEo2c3VZS2R0VWNYV0oKNCsyOE80RkxSS20xb09lYzIzajdLakJYam9zZURFditQYUNMQVRJRGMwSm9KWEZMUW5FTUplMDZmQzRQc3lTKwowS1FzRGVWRTFtMEVhV3V4TlE1aFpxS2ZhZnBwMjJNQWxrdmZqaVBkbWpYTWZkK096ZHFHSEJEbDdkbjViMlo3CnJpTVVPZkVrdDY5WnVFZi9CTm0wK3VJSDJSMkZWemtSemFMNgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 00:54:20.847 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://A000627F84EED29E16FC1203768E6D36.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/A000627F84EED29E16FC1203768E6D36"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Environment" = "test"
        }
        # (3 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-04d843860f8e02280" -> (known after apply)
          ~ subnet_ids                = [ # forces replacement
              - "subnet-00dd6ad17f28e0110",
              + "subnet-02b7b75b8875b6f02",
              + "subnet-06dff361d9daa34ea",
              - "subnet-073345847327cab44",
              + "subnet-0a134ea213c4bf0e2",
              - "subnet-0aff3cd4393d112eb",
            ]
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:ff9d4b35-4568-41ca-a742-f0cf480964f7:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210824010311758600000002" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210824010311758600000002" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210824010311758600000002" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjNUbFJyTVU1R2IxaEVWRTE0VFVSbmVVMXFRWGRPVkdzeFRrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG5kcENqSklUR3AwVW5oTlFrdzBTMGx0T1ZOemJWRm9abFpIUVRGcFFqRkxjSE5uWmtkbVRVaFZhblZ4V2twdldUZFpVVk5XYUVKWlJ6QlhLMlp2WWpWT1MyTUtNRnB6U2xOeWFuQndlRGhDTTBZeFlUZGxhRFpaWW5wNVZTczVkMHBUTVhScGIxSlJWMEo0TkdWRlRuZGlURUZZZFRoNVNHdGxUelZsTDNCWFVUUldZUXBOUkhnMVJsYzVjbWxHUkVOYWNFVmlabU51VkdWdVpYSkVlSE14YVZKS1NUaFVOVkZ3U0RsTWJFSlJPSEJLYlZGSmVuZDRTVXRyUVdSVmVGZFhSRUphQ205VkswRk5lbVU0Yld0aWVsUnlSbVZGT0ZKS1prTXJWR1Z1TUZWMlIwOVdWMDEzYURKT09FMHlZMGhyVTI5V1NuRkRNaXN6Wm0xMVppOHZTR3B3VkRFS1VrTTRjR2xYUmpadUwxbHNZbVJXV2xCdk0yNDFhVFJPV1cxWWJFSmhhVEF6ZGxWRlRrOURUSGRzTUVaeFJURjNaMkpNU2xZMVNGSnFkVFpsVVhneE13bzNURmRTVVhCU2VrZGpURmdyYmt3eFRXVkZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWlBPSFI0VUhCbVIzcG5VMUp1WTFKSEsyaHVPRmhrY1UxUWJFWk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkVTMEZKZGxjelQzQk1UMDA0VkVzMmEyMVlLMW9yYkdOWGNqTjVVRXBJUVZVNFlXWTBiVGRpUW5aT1pISTVWR2x3WWdwSFEzTnJSaXRzZG5kTFZFOXhPRUl3WXpabkwweEJjVVpaVkM5d1RsZFpjWEk1TUZJekx6TlZkM1pLZDBGelZtOVJabE5pYVRsclpGQldZMHRvU1dWQ0NtSjZNMUF5ZFU5TlpIaENUM0pMVjJOWlRTOVZWMGhoTlhOd01uVlJheTl2WjBGcE1uazNOMDQ1Y3preU5VMUpiWFJqZEVvMmMzVlpTMlIwVldOWVYwb0tOQ3N5T0U4MFJreFNTMjB4YjA5bFl6SXphamRMYWtKWWFtOXpaVVJGZGl0UVlVTk1RVlJKUkdNd1NtOUtXRVpNVVc1RlRVcGxNRFptUXpSUWMzbFRLd293UzFGelJHVldSVEZ0TUVWaFYzVjRUbEUxYUZweFMyWmhabkJ3TWpKTlFXeHJkbVpxYVZCa2JXcFlUV1prSzA5NlpIRkhTRUpFYkRka2JqVmlNbG8zQ25KcFRWVlBaa1ZyZERZNVduVkZaaTlDVG0wd0szVkpTREpTTWtaV2VtdFNlbUZNTmdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQTAwMDYyN0Y4NEVFRDI5RTE2RkMxMjAzNzY4RTZEMzYuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:24d86235-520f-4d32-b6b0-23f8bf59429d:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210824010311722500000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210824010311722500000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210824010311722500000001" -> (known after apply)
      ~ security_groups                  = [ # forces replacement
          - "sg-00a9df337c017e67f",
          + "sg-081c66a871fd32313",
            # (1 unchanged element hidden)
        ]
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjNUbFJyTVU1R2IxaEVWRTE0VFVSbmVVMXFRWGRPVkdzeFRrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG5kcENqSklUR3AwVW5oTlFrdzBTMGx0T1ZOemJWRm9abFpIUVRGcFFqRkxjSE5uWmtkbVRVaFZhblZ4V2twdldUZFpVVk5XYUVKWlJ6QlhLMlp2WWpWT1MyTUtNRnB6U2xOeWFuQndlRGhDTTBZeFlUZGxhRFpaWW5wNVZTczVkMHBUTVhScGIxSlJWMEo0TkdWRlRuZGlURUZZZFRoNVNHdGxUelZsTDNCWFVUUldZUXBOUkhnMVJsYzVjbWxHUkVOYWNFVmlabU51VkdWdVpYSkVlSE14YVZKS1NUaFVOVkZ3U0RsTWJFSlJPSEJLYlZGSmVuZDRTVXRyUVdSVmVGZFhSRUphQ205VkswRk5lbVU0Yld0aWVsUnlSbVZGT0ZKS1prTXJWR1Z1TUZWMlIwOVdWMDEzYURKT09FMHlZMGhyVTI5V1NuRkRNaXN6Wm0xMVppOHZTR3B3VkRFS1VrTTRjR2xYUmpadUwxbHNZbVJXV2xCdk0yNDFhVFJPV1cxWWJFSmhhVEF6ZGxWRlRrOURUSGRzTUVaeFJURjNaMkpNU2xZMVNGSnFkVFpsVVhneE13bzNURmRTVVhCU2VrZGpURmdyYmt3eFRXVkZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWlBPSFI0VUhCbVIzcG5VMUp1WTFKSEsyaHVPRmhrY1UxUWJFWk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkVTMEZKZGxjelQzQk1UMDA0VkVzMmEyMVlLMW9yYkdOWGNqTjVVRXBJUVZVNFlXWTBiVGRpUW5aT1pISTVWR2x3WWdwSFEzTnJSaXRzZG5kTFZFOXhPRUl3WXpabkwweEJjVVpaVkM5d1RsZFpjWEk1TUZJekx6TlZkM1pLZDBGelZtOVJabE5pYVRsclpGQldZMHRvU1dWQ0NtSjZNMUF5ZFU5TlpIaENUM0pMVjJOWlRTOVZWMGhoTlhOd01uVlJheTl2WjBGcE1uazNOMDQ1Y3preU5VMUpiWFJqZEVvMmMzVlpTMlIwVldOWVYwb0tOQ3N5T0U4MFJreFNTMjB4YjA5bFl6SXphamRMYWtKWWFtOXpaVVJGZGl0UVlVTk1RVlJKUkdNd1NtOUtXRVpNVVc1RlRVcGxNRFptUXpSUWMzbFRLd293UzFGelJHVldSVEZ0TUVWaFYzVjRUbEUxYUZweFMyWmhabkJ3TWpKTlFXeHJkbVpxYVZCa2JXcFlUV1prSzA5NlpIRkhTRUpFYkRka2JqVmlNbG8zQ25KcFRWVlBaa1ZyZERZNVduVkZaaTlDVG0wd0szVkpTREpTTWtaV2VtdFNlbUZNTmdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQTAwMDYyN0Y4NEVFRDI5RTE2RkMxMjAzNzY4RTZEMzYuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 4 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_endpoint = "https://A000627F84EED29E16FC1203768E6D36.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id       = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ kubectl_config   = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://A000627F84EED29E16FC1203768E6D36.sk1.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF3TlRrMU5Gb1hEVE14TURneU1qQXdOVGsxTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTndpCjJITGp0UnhNQkw0S0ltOVNzbVFoZlZHQTFpQjFLcHNnZkdmTUhVanVxWkpvWTdZUVNWaEJZRzBXK2ZvYjVOS2MKMFpzSlNyanBweDhCM0YxYTdlaDZZYnp5VSs5d0pTMXRpb1JRV0J4NGVFTndiTEFYdTh5SGtlTzVlL3BXUTRWYQpNRHg1Rlc5cmlGRENacEViZmNuVGVuZXJEeHMxaVJKSThUNVFwSDlMbEJROHBKbVFJend4SUtrQWRVeFdXREJaCm9VK0FNemU4bWtielRyRmVFOFJKZkMrVGVuMFV2R09WV013aDJOOE0yY0hrU29WSnFDMiszZm11Zi8vSGpwVDEKUkM4cGlXRjZuL1lsYmRWWlBvM241aTROWW1YbEJhaTAzdlVFTk9DTHdsMEZxRTF3Z2JMSlY1SFJqdTZlUXgxMwo3TFdSUXBSekdjTFgrbkwxTWVFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZPOHR4UHBmR3pnU1JuY1JHK2huOFhkcU1QbEZNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFES0FJdlczT3BMT004VEs2a21YK1orbGNXcjN5UEpIQVU4YWY0bTdiQnZOZHI5VGlwYgpHQ3NrRitsdndLVE9xOEIwYzZnL0xBcUZZVC9wTldZcXI5MFIzLzNVd3ZKd0FzVm9RZlNiaTlrZFBWY0toSWVCCmJ6M1AydU9NZHhCT3JLV2NZTS9VV0hhNXNwMnVRay9vZ0FpMnk3N045czkyNU1JbXRjdEo2c3VZS2R0VWNYV0oKNCsyOE80RkxSS20xb09lYzIzajdLakJYam9zZURFditQYUNMQVRJRGMwSm9KWEZMUW5FTUplMDZmQzRQc3lTKwowS1FzRGVWRTFtMEVhV3V4TlE1aFpxS2ZhZnBwMjJNQWxrdmZqaVBkbWpYTWZkK096ZHFHSEJEbDdkbjViMlo3CnJpTVVPZkVrdDY5WnVFZi9CTm0wK3VJSDJSMkZWemtSemFMNgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*